# GetLinePatternId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..GetLinePatternId Method
Category Class See Also
---
Gets the line pattern id associated with this category for the given graphics style type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId GetLinePatternId(
	GraphicsStyleType graphicsStyleType
)
```

Visual Basic
---
```text
Public Function GetLinePatternId ( _
	graphicsStyleType As GraphicsStyleType _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetLinePatternId(
	GraphicsStyleType graphicsStyleType
)
```

# ### Parameters
graphicsStyleType
    Type: Autodesk.Revit.DB..::..GraphicsStyleTypeThe type of graphics style.
# ### Return Value
Returns the line pattern id associated with this category for the given graphics style type.
# Remarks
  * The line pattern id will be one of the following:
  * A negative value (representing a built-in line pattern)
  * The id of a LinePatternElement
  * InvalidElementId, indicating that this category does not have a stored line pattern id for this graphics style type.

# See Also
Category Class
Autodesk.Revit.DB Namespace